[
    {
        "title": "Aquaman and The Lost Kingdom",
        "category": "Action, Adventure, Fantasy",
        "duration": "2h 4m",
        "synopsis": "Black Manta, still driven by the need to avenge his father's death and wielding the power of the mythic Black Trident, will stop at nothing to take Aquaman down once and for all. To defeat him, Aquaman must turn to his imprisoned brother Orm, the former King of Atlantis, to forge an unlikely alliance in order to save the world from irreversible destruction.",
        "synopsisId": "Black Manta, yang masih terdorong oleh keinginan untuk membalas dendam atas kematian ayahnya dan menggunakan kekuatan Trisula Hitam yang mistis, tidak akan berhenti untuk mengalahkan Aquaman untuk selamanya. Untuk mengalahkannya, Aquaman harus meminta bantuan saudaranya yang dipenjara, Orm, mantan Raja Atlantis, untuk menjalin aliansi yang tidak mungkin terjadi demi menyelamatkan dunia dari kehancuran yang tidak dapat dipulihkan.",
        "character": "Mort Weisinger",
        "director": "James Wan",
        "poster": "8xV47NDrjdZDpkVcCFqkdHa3T0C",
        "ticketPrice": 0,
        "isUpcoming": true
    },
    {
        "title": "Sijjin (2023)",
        "category": "Horror, Thriller",
        "duration": "1h 40m",
        "synopsis": "Irma falls in love with Galang, her cousin who already has a wife and children. Irma is very obsessed and wants to be the only woman in Galang's life. Irma comes to the shaman to send black magic to Galang's wife. Since then terror and mystical disturbances, possession and death have occurred in Galang's house. However, the threat also targeted Irma herself.",
        "synopsisId": "Irma jatuh cinta pada Galang, sepupunya yang sudah memiliki istri dan anak. Irma sangat terobsesi dan ingin menjadi satu-satunya wanita dalam hidup Galang. Irma mendatangi dukun untuk mengirimkan ilmu hitam kepada istri Galang. Sejak saat itu teror dan gangguan mistis, kerasukan dan kematian terjadi di rumah Galang. Namun, ancaman itu juga menyasar Irma sendiri.",
        "character": "Ibrahim Risyad",
        "director": "Hadrah Daeng Ratu",
        "poster": "bx1af23UcUIppXOXY3li8K9Y89K",
        "ticketPrice": 0,
        "isUpcoming": true
    },
    {
        "title": "Ferrari (2023)",
        "category": "Drama, History",
        "duration": "2h 10m",
        "synopsis": "A biopic of automotive mogul Enzo Ferrari, whose family redefined the idea of the high-powered Italian sports car and practically spawned the concept of Formula One racing.",
        "synopsisId": "Sebuah film biografi tentang maestro otomotif Enzo Ferrari, yang keluarganya mendefinisikan ulang ide mobil sport Italia bertenaga tinggi dan secara praktis melahirkan konsep balap Formula Satu.",
        "character": "Adam Driver",
        "director": "Michael Mann",
        "poster": "dAP9QTLVvglGvtsa0VesaOgHcTW",
        "ticketPrice": 0,
        "isUpcoming": true
    }
]