[
  {
    "title": "Upcoming: Trolls Band Together",
    "category": "Animasi, Keluarga, Musik, Fantasi, Komedi",
    "duration": "1h 32m",
    "synopsis": "When Branch's brother, Floyd, is kidnapped for his musical talents by a pair of nefarious pop-star villains, Branch and Poppy embark on a harrowing and emotional journey to reunite the other brothers and rescue Floyd from a fate even worse than pop-culture obscurity.",
    "synopsisId": "Ketika saudara laki-laki Branch, Floyd, diculik karena bakat musiknya oleh sepasang penjahat bintang pop yang jahat, Branch dan Poppy memulai perjalanan yang mengerikan dan emosional untuk menyatukan kembali saudara-saudara lainnya dan menyelamatkan Floyd dari nasib yang bahkan lebih buruk daripada ketidakjelasan budaya pop.",
    "character": "Thomas Dam",
    "director": "Walt Dohrn",
    "poster": "wiFUG5vF50xY2TKHxjd0Qj0auOT"
  },
  {
    "title": "Upcoming: Wonka",
    "category": "Komedi, Keluarga, Fantasi",
    "duration": "1h 57m",
    "synopsis": "Willy Wonka – chock-full of ideas and determined to change the world one delectable bite at a time – is proof that the best things in life begin with a dream, and if you’re lucky enough to meet Willy Wonka, anything is possible.",
    "synopsisId": "Willy Wonka – penuh dengan ide dan tekad untuk mengubah dunia sedikit demi sedikit – adalah bukti bahwa hal terbaik dalam hidup dimulai dari mimpi, dan jika Anda cukup beruntung bertemu Willy Wonka, segalanya mungkin terjadi.",
    "character": "Roald Dahl",
    "director": "Paul King",
    "poster": "xAKI0O5hUXxbmHRBNg72IzFQ06a"
  },
  {
    "title": "Upcoming: Five Nights at Freddy's",
    "category": "Kengerian, Misteri",
    "duration": "1h 50m",
    "synopsis": "Recently fired and desperate for work, a troubled young man named Mike agrees to take a position as a night security guard at an abandoned theme restaurant: Freddy Fazbear's Pizzeria. But he soon discovers that nothing at Freddy's is what it seems.",
    "synopsisId": "Baru-baru ini dipecat dan sangat membutuhkan pekerjaan, seorang pemuda bermasalah bernama Mike setuju untuk mengambil posisi sebagai penjaga keamanan malam di sebuah restoran bertema yang ditinggalkan: Freddy Fazbear's Pizzeria. Namun dia segera menyadari bahwa di Freddy's tidak ada yang seperti yang terlihat.",
    "character": "Josh Hutcherson",
    "director": "Emma Tammi",
    "poster": "7BpNtNfxuocYEVREzVMO75hso1l"
  }, 
  {
    "title": "Upcoming: The Hunger Games: The Ballad of Songbirds & Snakes", 
    "category": "Aksi, Percintaan, Drama", 
    "duration": "2h 37m", 
    "synopsis": "64 years before he becomes the tyrannical president of Panem, Coriolanus Snow sees a chance for a change in fortunes when he mentors Lucy Gray Baird, the female tribute from District 12.",
    "synopsisId": "64 tahun sebelum dia menjadi presiden Panem yang kejam, Coriolanus Snow melihat peluang perubahan nasib saat dia membimbing Lucy Gray Baird, peserta perempuan dari Distrik 12.",
    "character": "Tom Blyth",
    "director": "Francis Lawrence", 
    "poster": "mBaXZ95R2OxueZhvQbcEWy2DqyO"
  }, 
  {
    "title": "Upcoming: The Marvels", 
    "category": "Cerita Fiksi, Petualangan, Aksi", 
    "duration": "1h 45m", 
    "synopsis": "Carol Danvers, aka Captain Marvel, has reclaimed her identity from the tyrannical Kree and taken revenge on the Supreme Intelligence. But unintended consequences see Carol shouldering the burden of a destabilized universe. When her duties send her to an anomalous wormhole linked to a Kree revolutionary, her powers become entangled with that of Jersey City super-fan Kamala Khan, aka Ms. Marvel, and Carol’s estranged niece, now S.A.B.E.R. astronaut Captain Monica Rambeau. Together, this unlikely trio must team up and learn to work in concert to save the universe.", 
    "synopsisId": "Carol Danvers, alias Captain Marvel, telah mendapatkan kembali identitasnya dari Kree yang kejam dan membalas dendam pada Intelijen Tertinggi. Namun konsekuensi yang tidak diinginkan membuat Carol menanggung beban alam semesta yang tidak stabil. Ketika tugasnya mengirimnya ke lubang cacing anomali yang terkait dengan seorang revolusioner Kree, kekuatannya terjerat dengan penggemar berat Jersey City Kamala Khan, alias Ms. Marvel, dan keponakan perempuan Carol yang terasing, sekarang S.A.B.E.R. astronot Kapten Monica Rambeau. Bersama-sama, ketiganya harus bekerja sama dan belajar bekerja sama untuk menyelamatkan alam semesta.", 
    "character": "Brie Larson", 
    "director": "Nia DaCosta", 
    "poster": "3sXv15ymVkaV7E18m4TlTgwNkAN"
  }, 
  {
    "title": "Upcoming: Napoleon", 
    "category": "Drama, Sejarah, Kejahatan", 
    "duration": "2h 38m", 
    "synopsis": "An epic that details the checkered rise and fall of French Emperor Napoleon Bonaparte and his relentless journey to power through the prism of his addictive, volatile relationship with his wife, Josephine.",
    "synopsisId": "Sebuah epik yang merinci kebangkitan dan kejatuhan Kaisar Prancis Napoleon Bonaparte dan perjalanannya yang tiada henti menuju kekuasaan melalui prisma hubungannya yang adiktif dan tidak menentu dengan istrinya, Josephine.",
    "character": "Joaquin Phoenix",
    "director": "Ridley Scott",
    "poster": "jE5o7y9K6pZtWNNMEw3IdpHuncR"
  },
  {
    "title": "Upcoming: Wish", 
    "category": "Animasi, Keluarga, Fantasi, Petualangan", 
    "duration": "1h 35m", 
    "synopsis": "Asha, a sharp-witted idealist, makes a wish so powerful that it is answered by a cosmic force – a little ball of boundless energy called Star. Together, Asha and Star confront a most formidable foe - the ruler of Rosas, King Magnifico - to save her community and prove that when the will of one courageous human connects with the magic of the stars, wondrous things can happen.",
    "synopsisId": "Asha, seorang idealis yang cerdas, membuat sebuah keinginan yang begitu kuat sehingga terkabul oleh kekuatan kosmik – sebuah bola kecil energi tak terbatas yang disebut Bintang. Bersama-sama, Asha dan Star menghadapi musuh paling tangguh - penguasa Rosas, Raja Magnifico - untuk menyelamatkan komunitasnya dan membuktikan bahwa ketika keinginan seorang manusia pemberani terhubung dengan keajaiban bintang, hal-hal menakjubkan bisa terjadi.",
    "character": "Ariana DeBose",
    "director": "Chris Buck, Fawn Veerasunthorn",
    "poster": "AcoVfiv1rrWOmAdpnAMnM56ki19"
  },
  {
    "title": "Upcoming: Saw X", 
    "category": "Kengerian, Cerita Seru", 
    "duration": "1h 58m", 
    "synopsis": "A sick and desperate John travels to Mexico to undergo a risky and experimental medical procedure in the hope of finding a miracle cure for his cancer, but it turns out the entire operation was a scam to defraud the most vulnerable.",
    "synopsisId": "John yang sakit dan putus asa melakukan perjalanan ke Meksiko untuk menjalani prosedur medis yang berisiko dan eksperimental dengan harapan mendapatkan obat ajaib untuk kankernya, namun ternyata seluruh operasi tersebut adalah penipuan untuk menipu kelompok yang paling rentan.",
    "character": "Tobin Bell",
    "director": "Kevin Greutert",
    "poster": "aQPeznSu7XDTrrdCtT5eLiu52Yu"
  },
  {
    "title": "Upcoming: May December", 
    "category": "Drama, Komedi", 
    "duration": "1h 57m", 
    "synopsis": "Twenty years after their notorious tabloid romance gripped the nation, a married couple buckles under pressure when an actress arrives to do research for a film about their past.",
    "synopsisId": "Dua puluh tahun setelah kisah cinta mereka yang terkenal di tabloid melanda seluruh negeri, sepasang suami istri berada di bawah tekanan ketika seorang aktris datang untuk melakukan penelitian untuk sebuah film tentang masa lalu mereka.",
    "character": "Natalie Portman",
    "director": "Todd Haynes",
    "poster": "yibtHDMO70RueiEmtrcJeTiiHFo"
  },
  {
    "title": "Upcoming: Thanksgiving", 
    "category": "Kengerian, Cerita Seru, Misteri", 
    "duration": "1h 46m", 
    "synopsis": "After a Black Friday riot ends in tragedy, a mysterious Thanksgiving-inspired killer terrorizes Plymouth, Massachusetts - the birthplace of the holiday. Picking off residents one by one, what begins as random revenge killings are soon revealed to be part of a larger, sinister holiday plan.",
    "synopsisId": "Setelah kerusuhan Black Friday berakhir dengan tragedi, seorang pembunuh misterius yang terinspirasi Thanksgiving meneror Plymouth, Massachusetts - tempat kelahiran liburan tersebut. Menghabisi penduduk satu per satu, apa yang dimulai sebagai pembunuhan balas dendam acak segera terungkap menjadi bagian dari rencana liburan yang lebih besar dan menyeramkan.",
    "character": "Patrick Dempsey",
    "director": "Eli Roth",
    "poster": "f5f3TEVst1nHHyqgn7Z3tlwnBIH"
  }
]